#+TITLE: Environment Analyser

*** Seeing the effect of envvars

 If we want to see the effect of sourcing envvars, we can send the command
 through ssh.  Since we're sending a command, our =bash_profile= and =bashrc=
 will not get sourced (and =envvars= is sourced in my =bash_profile=)

 #+BEGIN_SRC sh :dir ~/Documents/GitHub/utils/misc :results output :exports code
 ssh localhost ~/Documents/GitHub/pyenv/env_diff source ~/.philconfig/FILES/envvars
 #+END_SRC

 #+RESULTS:
 #+begin_example
 ========== New variables ===========
 EDITOR=vim
 NOTES_DIR=~/Dropbox/Notes/Notes_BUCKET
 CDPATH=.
        /Users/pcarphin
        /Users/pcarphin/Documents
        /Users/pcarphin/Documents/GitHub
 FCEDIT=vim
 LESS= -FX -R
 LD_LIBRARY_PATH=/Users/pcarphin/.local/lib
                 /Users/pcarphin/.local/openblas/lib/
                 /Users/pcarphin/.local/libgit2/lib
                 /usr/local/cuda/lib
 DYLD_LIBRARY_PATH=/Users/pcarphin/.local/lib
                   /Users/pcarphin/.local/openblas/lib
                   /Developer/NVIDIA/CUDA-8.0/lib
 ========== Deleted variables =======
 ========= Changed Vars =============
 PATH
     ADDED:
       /Users/pcarphin/Documents/GitHub/utils/bin
       /Users/pcarphin/Library/Python/2.7/bin
       /usr/local/openclcc/bin
       /Developer/NVIDIA/CUDA-8.0/bin
       /Users/pcarphin/.local/bin
       /Library/Frameworks/Python.framework/Versions/3.5/bin
       /usr/local/opt/apr/bin
       /usr/lib64/openmpi/bin
     KEPT:
       /sbin
       /usr/bin
       /usr/sbin
       /bin

 #+end_example
 
*** Effects of sourcing zshrc and zprofile

 #+BEGIN_SRC sh :dir ~/Documents/GitHub/utils/misc :results output :exports code
 ssh localhost ~/Documents/GitHub/pyenv/env_diff source ~/.philconfig/zprofile \; source ~/.zshrc
 #+END_SRC

 #+RESULTS:
 #+begin_example
 ========== New variables ===========
 LD_LIBRARY_PATH=/Users/pcarphin/.local/lib
                 /Users/pcarphin/.local/openblas/lib/
                 /Users/pcarphin/.local/libgit2/lib
                 /usr/local/cuda/lib
 DYLD_LIBRARY_PATH=/Users/pcarphin/.local/lib
                   /Users/pcarphin/.local/openblas/lib
                   /Developer/NVIDIA/CUDA-8.0/lib
 PHILRC_ZPROFILE=.zprofile_sourced_at_2018-08-11_0126
 EDITOR=vim
 LESS= -FX -R
 PHILCONFIG=/Users/pcarphin/.philconfig
 CDPATH=.
        /Users/pcarphin
        /Users/pcarphin/Documents
        /Users/pcarphin/Documents/GitHub
 NOTES_DIR=~/Dropbox/Notes/Notes_BUCKET
 FCEDIT=vim
 ========== Deleted variables =======
 ========= Changed Vars =============
 PATH
     ADDED:
       /Users/pcarphin/Documents/GitHub/utils/bin
       /usr/local/CrossPack-AVR/bin
       /Users/pcarphin/Library/Python/2.7/bin
       /Users/pcarphin/.local/bin
       /usr/local/opt/apr/bin
       /Library/Frameworks/Python.framework/Versions/3.5/bin
       /Developer/NVIDIA/CUDA-8.0/bin
       /opt/X11/bin
       /usr/local/bin
       /usr/local/openclcc/bin
       /Library/TeX/texbin
       /usr/lib64/openmpi/bin
     KEPT:
       /usr/sbin
       /bin
       /usr/bin
       /sbin

 #+end_example

** Diff in reverse direction

 Just to show how it displays the =PATH=

 #+BEGIN_SRC sh :dir ~/Documents/GitHub/utils/misc :results output :exports code
 pyenv compare /tmp/env_local /tmp/env_ssh
 #+END_SRC

 #+RESULTS:
 #+begin_example
 ========== New variables ===========
 MAIL=/var/mail/pcarphin
 SSH_CLIENT=::1 56678 22 
 SSH_CONNECTION=::1 56678 ::1 22
 ========== Deleted variables =======
 INSIDE_EMACS=26.1,comint
 ITERM_SESSION_ID=w0t0p0:15A4662D-B702-4EF8-8A18-B30DED082D94
 SECURITYSESSIONID=186a7
 ZSH=/Users/pcarphin/.oh-my-zsh
 XPC_SERVICE_NAME=0
 PHILRC_ZSHRC=.zshrc_sourced_at_2018-08-11_0027
 TERM_SESSION_ID=w0t0p0:15A4662D-B702-4EF8-8A18-B30DED082D94
 NOTES_DIR=~/Dropbox/Notes/Notes_BUCKET
 COLORTERM=truecolor
 PHILCONFIG=/Users/pcarphin/.philconfig
 COLUMNS=91
 Apple_PubSub_Socket_Render=/private/tmp/com.apple.launchd.uPTww2MeS7/Render
 PHILRC_ZPROFILE=.zprofile_sourced_at_2018-08-11_0027
 FCEDIT=vim
 LSCOLORS=Gxfxcxdxbxegedabagacad
 TERM=dumb
 ITERM_PROFILE=Hotkey Window
 COLORFGBG=7;0
 DISPLAY=/private/tmp/com.apple.launchd.HvNY1kwxsC/org.macosforge.xquartz:0
 PAGER=less
 CDPATH=.
        /Users/pcarphin
        /Users/pcarphin/Documents
        /Users/pcarphin/Documents/GitHub
 TERM_PROGRAM=iTerm.app
 EDITOR=vim
 TERMCAP=
 TERM_PROGRAM_VERSION=3.2.0beta9
 XPC_FLAGS=0x0
 PHIL_ENV=home
 MANPATH=
 LESS= -FX -R
 SSH_AUTH_SOCK=/private/tmp/com.apple.launchd.fDpNgC3XtE/Listeners
 ========= Changed Vars =============
 PATH
     KEPT:
       /sbin
       /usr/bin
       /usr/sbin
       /bin
     DELETED:
       /Applications/Emacs.app/Contents/MacOS/libexec-x86_64-10_10
       /Users/pcarphin/.local/bin
       /usr/local/bin
       /Library/TeX/texbin
       /Users/pcarphin/Documents/GitHub/utils/bin
       /usr/lib64/openmpi/bin
       /Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_10
       /Users/pcarphin/Library/Python/2.7/bin
       /usr/local/CrossPack-AVR/bin
       I_edited_envvars_fiel
       /usr/local/opt/apr/bin
       /Developer/NVIDIA/CUDA-8.0/bin
       /usr/local/openclcc/bin
       /opt/X11/bin
       /Library/Frameworks/Python.framework/Versions/3.5/bin
 #+end_example

